using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Yandex.SpeechKit.Demo
{
    class Cities
    {
        public Cities()
        {
            citiesSet = new SortedSet<string>();
        }        

        public void InitializeCitiesSet()
        {
            
            foreach (string city in citiesArray)
            {
                citiesSet.Add(city);
            }
        }

        public void ReleaseCitiesSet()
        {
            citiesSet.Clear();
        }

        public bool PullCityByName(string cityName)
        {
            // If deleted - true, otherwise - false
            bool found = citiesSet.Remove(cityName);
            if (found)
            {
                prevCity = cityName;
            }
            return found;
        }

        public string previousCity
        {
            get { return prevCity; }
        }

        private string prevCity;
        private SortedSet<string> citiesSet;
        private string[] citiesArray = { 
            "Абакан", "Абдулино", "Абинск", "Агрыз", "Адыгейск", 
            "Азнакаево", "Азов", "Алагир", "Алапаевск", "Алатырь", 
            "Алейск", "Алзамай", "Алупка", "Алушта", "Альметьевск", 
            "Амурск", "Анадырь", "Анапа", "Ангарск", "Андреаполь", 
            "Апатиты", "Апрелевка", "Апшеронск", "Арамиль", "Арзамас", 
            "Аркадак", "Армянск", "Арск", "Архангельск", "Асино", 
            "Астрахань", "Аткарск", "Ахтубинск", "Ачинск", "Аша", 
            "Бабаево", "Бавлы", "Багратионовск", "Байкальск", "Баймак", 
            "Бакал", "Балабаново", "Балаково", "Балахна", "Балашиха", 
            "Балей", "Балтийск", "Барабинск", "Барнаул", "Батайск", 
            "Бахчисарай", "Бежецк", "Белгород", "Белебей", "Белово", 
            "Белозерск", "Белокуриха", "Беломорск", "Белорецк", "Белореченск", 
            "Бердск", "Березники", "Беслан", "Бийск", "Билибино", 
            "Биробиджан", "Бирск", "Бирюсинск", "Благовещенск", "Благодарный", 
            "Богородицк", "Богородск", "Богучар", "Бокситогорск", "Болгар", 
            "Бологое", "Болотное", "Болохово", "Болхов", "Борзя", 
            "Борисоглебск", "Боровичи", "Боровск", "Братск", "Бронницы", 
            "Брянск", "Бугульма", "Бугуруслан", "Бузулук", "Буйнакск", 
            "Бутурлиновка", "Валдай", "Валуйки", "Велиж", "Вельск", 
            "Верещагино", "Верея", "Верхнеуральск", "Верхотурье", "Верхоянск", 
            "Весьегонск", "Видное", "Вилюйск", "Вилючинск", "Вихоревка", 
            "Вичуга", "Владивосток", "Владикавказ", "Волгоград", "Волгодонск", 
            "Волгореченск", "Волжск", "Волжский", "Вологда", "Володарск", 
            "Волоколамск", "Волосово", "Вольск", "Воркута", "Воронеж", 
            "Ворсма", "Воскресенск", "Воткинск", "Всеволожск", "Вуктыл", 
            "Выборг", "Выкса", "Высоковск", "Высоцк", "Вытегра", 
            "Вязники", "Вязьма", "Гаджиево", "Гатчина", "Гвардейск", 
            "Гдов", "Геленджик", "Георгиевск", "Глазов", "Голицыно", 
            "Городец", "Городовиковск", "Гороховец", "Грайворон", "Гремячинск", 
            "Грозный", "Грязи", "Грязовец", "Губаха", "Губкинский", 
            "Гудермес", "Гулькевичи", "Давлеканово", "Далматово", "Дальнегорск", 
            "Дальнереченск", "Данков", "Дегтярск", "Дедовск", "Дербент", 
            "Десногорск", "Джанкой", "Дивногорск", "Дигора", "Дмитров", 
            "Дмитровск", "Добрянка", "Долгопрудный", "Долинск", "Дорогобуж", 
            "Дрезна", "Дубна", "Дубовка", "Дудинка", "Духовщина", 
            "Дюртюли", "Дятьково", "Евпатория", "Егорьевск", "Ейск", 
            "Екатеринбург", "Елабуга", "Елец", "Елизово", "Ельня", 
            "Еманжелинск", "Емва", "Енисейск", "Ессентуки", "Железноводск", 
            "Жердевка", "Жирновск", "Завитинск", "Заводоуковск", "Заволжск", 
            "Задонск", "Заинск", "Закаменск", "Заполярный", "Зарайск", 
            "Заринск", "Звенигово", "Звенигород", "Зверево", "Зеленоградск", 
            "Зеленокумск", "Зерноград", "Златоуст", "Злынка", "Змеиногорск", 
            "Зубцов", "Зуевка", "Ивангород", "Иваново", "Ивантеевка", 
            "Ивдель", "Игарка", "Ижевск", "Избербаш", "Изобильный", 
            "Иланский", "Инза", "Инкерман", "Инта", "Ипатово", 
            "Ирбит", "Иркутск", "Исилькуль", "Искитим", "Ишим", 
            "Ишимбай", "Кадников", "Казань", "Калачинск", "Калининград", 
            "Калининск", "Калуга", "Калязин", "Камбарка", "Каменногорск", 
            "Камешково", "Камызяк", "Камышин", "Камышлов", "Канаш", 
            "Кандалакша", "Канск", "Карабаново", "Карабаш", "Карачаевск", 
            "Карачев", "Каргополь", "Карпинск", "Карталы", "Касимов", 
            "Касли", "Каспийск", "Катайск", "Качканар", "Кашин", 
            "Кашира", "Кемерово", "Керчь", "Кизел", "Кизилюрт", 
            "Кизляр", "Кимовск", "Кимры", "Кингисепп", "Кинель", 
            "Кинешма", "Киренск", "Киржач", "Кириши", "Кировград", 
            "Кирс", "Кирсанов", "Кисловодск", "Климовск", "Клинцы", 
            "Княгинино", "Ковдор", "Ковров", "Ковылкино", "Когалым", 
            "Кодинск", "Козельск", "Козьмодемьянск", "Кологрив", "Коломна", 
            "Колпашево", "Колпино", "Кольчугино", "Конаково", "Кондопога", 
            "Кондрово", "Константиновск", "Копейск", "Кораблино", "Кореновск", 
            "Коркино", "Короча", "Коряжма", "Костомукша", "Кострома", 
            "Котельники", "Котельниково", "Котельнич", "Котлас", "Котово", 
            "Кохма", "Красавино", "Красновишерск", "Красногорск", "Краснодар", 
            "Краснозаводск", "Краснокаменск", "Краснокамск", "Красноперекопск", "Краснотурьинск", 
            "Красноуральск", "Красноуфимск", "Красноярск", "Кронштадт", "Крымск", 
            "Кстово", "Кубинка", "Кувандык", "Кувшиново", "Кудымкар", 
            "Кулебаки", "Кумертау", "Кунгур", "Курганинск", "Курильск", 
            "Курлово", "Куровское", "Курск", "Куртамыш", "Куса", 
            "Кушва", "Кызыл", "Кыштым", "Кяхта", "Лабинск", 
            "Лабытнанги", "Лагань", "Ладушкин", "Лаишево", "Лакинск", 
            "Лангепас", "Лахденпохья", "Лебедянь", "Ленск", "Лесной", 
            "Лесозаводск", "Лесосибирск", "Ливны", "Липецк", "Липки", 
            "Лиски", "Лихославль", "Лобня", "Луга", "Лукоянов", 
            "Луховицы", "Лысково", "Лысьва", "Лыткарино", "Льгов", 
            "Люберцы", "Любим", "Людиново", "Лянтор", "Магадан", 
            "Магас", "Магнитогорск", "Майкоп", "Макарьев", "Макушино", 
            "Малгобек", "Малмыж", "Малоярославец", "Мамадыш", "Мамоново", 
            "Мантурово", "Мариинск", "Махачкала", "Мглин", "Мегион", 
            "Медвежьегорск", "Медногорск", "Медынь", "Междуреченск", "Меленки", 
            "Мелеуз", "Менделеевск", "Мензелинск", "Мещовск", "Миасс", 
            "Микунь", "Миллерово", "Минусинск", "Миньяр", "Мичуринск", 
            "Могоча", "Можайск", "Можга", "Моздок", "Мончегорск", 
            "Морозовск", "Моршанск", "Мосальск", "Москва", "Муравленко", 
            "Мураши", "Мурманск", "Муром", "Мценск", "Мыски", 
            "Мытищи", "Мышкин", "Навашино", "Наволоки", "Надым", 
            "Назрань", "Называевск", "Нальчик", "Нарткала", "Невель", 
            "Невельск", "Невинномысск", "Невьянск", "Нелидово", "Нерчинск", 
            "Нерюнгри", "Нефтекамск", "Нефтекумск", "Нефтеюганск", "Нижневартовск", 
            "Нижнекамск", "Нижнеудинск", "Новоалександровск", "Новоалтайск", "Новоаннинский", 
            "Нововоронеж", "Новодвинск", "Новозыбков", "Новокубанск", "Новокузнецк", 
            "Новокуйбышевск", "Новомичуринск", "Новопавловск", "Новоржев", "Новороссийск", 
            "Новосибирск", "Новосиль", "Новосокольники", "Новотроицк", "Новоузенск", 
            "Новоульяновск", "Новоуральск", "Новочебоксарск", "Новочеркасск", "Новошахтинск", 
            "Ногинск", "Нолинск", "Норильск", "Ноябрьск", "Нурлат", 
            "Нытва", "Нюрба", "Нягань", "Нязепетровск", "Няндома", 
            "Обнинск", "Обоянь", "Одинцово", "Окуловка", "Оленегорск", 
            "Олонец", "Омск", "Омутнинск", "Опочка", "Оренбург", 
            "Орск", "Осинники", "Осташков", "Островной", "Острогожск", 
            "Отрадный", "Оха", "Оханск", "Палласовка", "Партизанск", 
            "Певек", "Пенза", "Первоуральск", "Пермь", "Пестово", 
            "Петергоф", "Петрозаводск", "Печоры", "Питкяранта", "Плавск", 
            "Поворино", "Подольск", "Подпорожье", "Покачи", "Полевской", 
            "Полесск", "Полысаево", "Полярный", "Поронайск", "Порхов", 
            "Похвистнево", "Почеп", "Правдинск", "Приволжск", "Приозерск", 
            "Прокопьевск", "Протвино", "Прохладный", "Псков", "Пудож", 
            "Пустошка", "Пучеж", "Пушкино", "Пущино", "Пыталово", 
            "Пятигорск", "Райчихинск", "Раменское", "Рассказово", "Реж", 
            "Реутов", "Ржев", "Рославль", "Россошь", "Ростов", 
            "Ртищево", "Рубцовск", "Руза", "Рузаевка", "Рыбинск", 
            "Рыбное", "Рыльск", "Ряжск", "Рязань", "Салават", 
            "Салаир", "Салехард", "Сальск", "Самара", "Саранск", 
            "Сарапул", "Саратов", "Саров", "Сасово", "Сатка", 
            "Саяногорск", "Саянск", "Светлоград", "Светогорск", "Свирск", 
            "Себеж", "Севастополь", "Северобайкальск", "Северодвинск", "Североморск", 
            "Североуральск", "Севск", "Сегежа", "Семикаракорск", "Семилуки", 
            "Сенгилей", "Сергач", "Сердобск", "Серпухов", "Сестрорецк", 
            "Сибай", "Симферополь", "Сковородино", "Скопин", "Славск", 
            "Слободской", "Смоленск", "Снежинск", "Собинка", "Солигалич", 
            "Соликамск", "Солнечногорск", "Сольвычегодск", "Сольцы", "Сорочинск", 
            "Сорск", "Сортавала", "Сосенский", "Сосногорск", "Сочи", 
            "Среднеколымск", "Среднеуральск", "Сретенск", "Ставрополь", "Стародуб", 
            "Стерлитамак", "Стрежевой", "Струнино", "Ступино", "Суджа", 
            "Судогда", "Суздаль", "Суоярви", "Сураж", "Сургут", 
            "Суровикино", "Сурск", "Сусуман", "Сухиничи", "Сызрань", 
            "Сыктывкар", "Сясьстрой", "Таганрог", "Тайшет", "Талдом", 
            "Тамбов", "Татарск", "Таштагол", "Тверь", "Теберда", 
            "Тейково", "Темников", "Темрюк", "Тетюши", "Тихвин", 
            "Тихорецк", "Тобольск", "Тогучин", "Тольятти", "Томмот", 
            "Томск", "Торжок", "Торопец", "Тосно", "Тотьма", 
            "Трубчевск", "Туапсе", "Туймазы", "Тула", "Тулун", 
            "Туринск", "Тутаев", "Тында", "Тырныауз", "Тюкалинск", 
            "Тюмень", "Углич", "Удачный", "Удомля", "Ужур", 
            "Узловая", "Ульяновск", "Унеча", "Урай", "Урень", 
            "Уржум", "Урюпинск", "Усинск", "Усмань", "Усолье", 
            "Уссурийск", "Устюжна", "Уфа", "Ухта", "Учалы", 
            "Уяр", "Фатеж", "Феодосия", "Фролово", "Фрязино", 
            "Хабаровск", "Хадыженск", "Харабали", "Харовск", "Хасавюрт", 
            "Хвалынск", "Химки", "Холмск", "Хотьково", "Цивильск", 
            "Цимлянск", "Чадан", "Чапаевск", "Чебоксары", "Челябинск", 
            "Чердынь", "Черепаново", "Череповец", "Черкесск", "Черноголовка", 
            "Черногорск", "Черняховск", "Чистополь", "Чита", "Чудово", 
            "Чусовой", "Чухлома", "Шагонар", "Шадринск", "Шали", 
            "Шарыпово", "Шарья", "Шатура", "Шахунья", "Шебекино", 
            "Шенкурск", "Шимановск", "Шиханы", "Шлиссельбург", "Шумерля", 
            "Шуя", "Щербинка", "Щигры", "Электрогорск", "Электросталь", 
            "Электроугли", "Элиста", "Эртиль", "Югорск", "Южа", 
            "Южноуральск", "Юрга", "Юрьевец", "Юхнов", "Ядрин", 
            "Якутск", "Ялта", "Ялуторовск", "Янаул", "Яранск", 
            "Яровое", "Ярославль", "Ярцево", "Ясный", "Яхрома" };

    }
}
